def var6(p1, p2, p3, p4, p5, p6, p7):
    r12 = 1 - (1 - p1) * (1 - p2)
    r13 = 1 - (1 - p1) * (1 - p3)
    r23 = 1 - (1 - p2) * (1 - p3)
    r134 = r13 * p4
    r56 = 1 - (1 - p5) * (1 - p6)
    r57 = 1 - (1 - p5) * (1 - p6)
    r67 = 1 - (1 - p6) * (1 - p7)
    s1 = r134 * r56
    s2 = r23 * r57
    ss = 1 - (1 - s1) * (1 - s2)
    t = r12 * ss * r67
    return t


if __name__ == '__main__':
    P1 = 0.32
    P2 = 0.82
    P3 = 0.15
    P4 = 0.24
    P5 = 0.66
    P6 = 0.99
    P7 = 0.93
    print("Імовірність безвідмовної роботи системи:", var6(P1, P2, P3, P4, P5, P6, P7))
